app/controllers/papers_controller.rb

  def index
    if current_user
      @papers = Paper.where(:position => current_user.preference)
    else
      @papers = Paper.all
---
SELECT "papers".* FROM "papers" WHERE "papers"."position" = $1  [["position", "left"]]
SELECT "papers".* FROM "papers"