app/controllers/savedlinks_controller.rb

	def create
		savedlink = SavedLink.where(user_id: current_user).create do |link|
---
INSERT INTO "saved_links" ("title", "subtitle", "url", "imageurl", "created_at", "updated_at", "user_id", "source") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

	def destroy
		@savedlink = SavedLink.find(params[:id])
		@savedlink.destroy
---
SELECT  "saved_links".* FROM "saved_links" WHERE "saved_links"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "saved_links" WHERE "saved_links"."id" = $1  [["id", 1]]